package hw3;

import java.util.Scanner;

public class HW3t4 {
    /*(Використовувати оператори if-else-if) Користувач вводить з клавіатури числа:
     Якщо число дорівнює 1, виведення на консоль “Понеділок”; Якщо число дорівнює 2,
     виведення на консоль “Вівторок”; Якщо число дорівнює 3, виведення на консоль “Середовище”;
     Якщо число дорівнює 4, виведення на консоль “Четвер”; Якщо число дорівнює 5, виведення
      на консоль “П'ятниця”; Якщо число дорівнює 6, виведення на консоль “Субота”;
      Якщо число дорівнює 7, то виведення на консоль "Неділя"; В іншому випадку
      виводимо текст: "Краще б сьогодні була п'ятниця".
     */
    public static void main(String[] args) {
        Scanner dayByNumber = new Scanner(System.in);


    }
}
