package hw4;

public class HW4t4 {
    /*Перший складатиметься з наступних імен: “Петя”, “Маша”, “Олена”, “Федя”,
     “Саша”, “Антон”, “Гліб”. Другий міститиме такі значення типу int: 10, 12,
     14, 16, 18, 20. Третій міститиме такі значення: “школу”, “магазин”, “церква”,
     “тренажерний зал”, “кіно”, “поліклініку” . Користувач вводить три числа з клавіатури,
     які відповідатимуть індексам кожного з елементів масивів. Приклад1. після введення
     3,2,1: На екрані має вивестися наступне повідомлення: “Федя буде йти до магазину о 14:00”
     Приклад2. після введення 1,2,3: На екрані має вивестися наступне повідомлення:
     "Маша йтиме в тренажерний зал о 14:00"*/
    public static void main(String[] args){
        String[] arrayName= {"Петя", "Маша", "Олена", "Федя","Саша","Антон","Гліб"};

        int[] number = new int[20];

        String [] arrayPlace = {"школа", "магазин", "церква",
     "тренажерний зал", "кіно", "поліклініка"};





    }
}
