package hw4;

public class HW4t3 {
    /*Написати програму, умовно для складу прийому металу.
     Припустимо, що склад може зберігати певну вагу металу.
     Користувач вводить з клавіатури вагу, яка може зберігатися на складі.
     Далі користувач вводить з клавіатури вагу, яку умовно збирається здати на склад користувач.
     Програма повинна після кожної здачі металу показувати скільки ваги може прийняти склад.
     Якщо користувач хоче здати металу більше ніж залишилося місця на складі,
     то програма не дає йому це зробити і повідомляє користувача про неможливість цієї операції.
     Якщо користувач здає метал вагою менше 5, програма теж попереджає про неможливість
     приймання такої малої ваги. Програма завершується, коли місце на складі закінчилось.*/
    public static void main(String[] args){

    }
}
