package hw9;

public class Family {
/*Завдання
• Створіть та опишіть класи: Домашній улюбленець (Pet),
 Людина (Human). Створіть конструктори для написаних класів.
  Створіть клас Main та у ньому створіть екземпляри описаних класів.
• Зробіть поля всіх класів приватними.
• Створіть та опишіть клас Сім'я (Family). Вважатимемо,
що сім'я може створюватися двома людьми, які не розходяться і можуть
народжувати/усиновлювати своїх дітей. Діти можуть дорослішати та йти з сім'ї,
 створюючи свою власну.
• Перевизначте методи equals() та hashCode() у всіх класах проєкту.
• У класі Family додайте метод deleteChild(Human child) з
 урахуванням наявності даних методів.


 • Створіть та опишіть клас Сім'я (Family). Вважатимемо, що сім'я може створюватися двома людьми, які не розходяться і можуть народжувати/усиновлювати своїх дітей. Діти можуть дорослішати та йти з сім'ї, створюючи свою власну.
• Перевизначте методи equals() та hashCode() у всіх класах проєкту.
• У класі Family додайте метод deleteChild(Human child) з урахуванням наявності даних методів.
*/
    private Human mother;
private Human father;
private Human[] children;
private Pet pet;

public  void deleteChild(Human child){

}

}
