package hw10.shopTask1;

public class ShopMain {
    /*1) Написати метод, який виводитиме на консоль інформацію про назву магазину,
     в якому відбувається покупка, про вартість даної покупки. Про ім'я продавця, який
      продає товар, про ім'я покупця, який купує товар, назву товару та вік покупця.
• Продавець може бути чесним чи ні.
• Якщо він чесний і товар є алкогольним, тоді він не продасть даний товар покупцю.
• Якщо він нечесний і товар є алкогольним, тоді він продасть даний товар покупцю.
• Якщо покупець має знижкову картку, то ціна покупки буде знижена на 10 відсотків.
• Усі поля класів мають бути приватними.
• Метод покупки належить самому магазину.
• Властивість чесності належить лише продавцеві.
• Тільки покупець може мати карту знижки.

Також метод, який необхідно реалізувати для вирішення цього завдання,
має імплементувати функціональний інтерфейс з таким самим методом.

*/
    public static void main(String[] args) {
       Shop shop = new Shop("Малінка", 120, "Сергій", 17, true,"Ольга", false, "Пиво", true);
       shop.returnCost("Малінка", 120, "Сергій", 17, false,"Ольга", true, "пиво", false);
    }
}
