package hw10.arrayTask2;

public class Array {
    /*) Створити метод, у якому створюється одновимірний масив типу int довільного
    розміру від 1 до 30, в якому кожному елементу масиву надається довільне значення
    від 0 до 30. Даний метод запитує користувача ввести з клавіатури індекс випадково
    згенерованого масиву. Метод повертає значення типу double, яке виходить при розподілі
    елемента із зазначеним індексом користувача на перший елемент даного масиву.
Продумати всі можливі виняткові ситуації, які можуть виникнути у цьому методі. Для кожної
виняткової ситуації створити власний клас checked винятки. Прописати у методі умови генерації
даних винятків, і навіть вказати в сигнатурі даного методу.
Обробку виключення здійснити в сторонньому класі Main в якому потрібно викликати даний метод.*/
    public int [] array;
}
